# Author: Abolfazl Vakily

In [15]:
import pandas as pd
import numpy as np
from numpy.random import randn

## ساخت جدول به همراه داده های رندوم

In [18]:
np.random.seed(101)
dta = pd.DataFrame(data=randn(5,4),
                   index=['A','B','C','D','E'],
                   columns=['W','X','Y','Z']
                  )
dta.head()

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## type

In [73]:
dta.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 5 columns):
W         4 non-null float64
X         4 non-null float64
Y         4 non-null float64
Z         4 non-null float64
states    4 non-null object
dtypes: float64(4), object(1)
memory usage: 256.0+ bytes

In [19]:
type(dta['W'])

pandas.core.series.Series

In [20]:
type(dta[['W']])

pandas.core.frame.DataFrame

## کوئری متغیرها

In [22]:
dta['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
dta[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [25]:
dta[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

## جمع متغیر های عددی

In [32]:
dta['new'] = dta['W'] + dta['Y']
dta.head(n=3)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

## حذف یک ستون

In [33]:
dta.drop(labels=['new',],axis=1,inplace=True)
dta

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
# df will define later
del df['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

## پاک کردن ردیف

In [34]:
dta.drop(index=['E',],axis=0,inplace=True)
dta

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

## تعداد سطر و ستون

In [35]:
dta.shape

(4, 4)

## دسترسی به داده بر اساس شاخص

In [50]:
dta.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [41]:
dta.loc[['B', 'D']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [44]:
dta.loc['B':]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [52]:
dta.loc['B','Y']

-0.8480769834036315

## دسترسی به داده از طریق شماره ردیف
### شماره ردیف ها از صفر شروع می شود

In [46]:
dta.iloc[0:]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [47]:
type(dta.iloc[0:])

pandas.core.frame.DataFrame

In [48]:
dta.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [49]:
type(dta.iloc[0])

pandas.core.series.Series

## کوری زدن به صورت شرطی

In [53]:
dta >= 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [55]:
dta[dta >= 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [56]:
dta['W'] > 0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [57]:
dta[dta['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [58]:
dta[dta['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [59]:
dta[dta['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [60]:
dta[(dta['W']>0)&(dta['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [61]:
dta[(dta['W']>0)|(dta['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

## reset_index

In [63]:
dta.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

## اضافه نمودن یک ستون جدید

In [65]:
newind = 'CA NY WY OR'.split()
dta['states'] = newind
dta

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

In [66]:
dta.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

## اطلاعاتی درباره داده های یونیک

In [68]:
tmp_data = {
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
}
df = pd.DataFrame(data=tmp_data)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [71]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [70]:
df[['col2']].unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

## تعداد داده های یونیک

In [72]:
df['col2'].nunique()

3

In [74]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## if

In [75]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [79]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [76]:
def times2(x):
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [78]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

## توابع تجمعی

In [77]:
df['col1'].sum()

10

## اسم ستون ها

In [81]:
df.columns

Index(['col2', 'col3'], dtype='object')

## درباره شناسه

In [82]:
df.index

RangeIndex(start=0, stop=4, step=1)

## مرتب کردن ستون ها براساس ستونی خاص

In [83]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

## اون ھایی که خالین به صورت بولین نشان بده

In [85]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [86]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [88]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,0]
zip(outside, inside)

In [89]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 0)]

In [90]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,0]
heir_index = list(zip(outside, inside))
heir_index = pd.MultiIndex.from_tuples(heir_index)

In [91]:
heir_index

MultiIndex(levels=[['G1', 'G2'], [0, 1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [1, 2, 3, 1, 2, 0]])

In [95]:
df = pd.DataFrame(data=randn(6,2), index=heir_index, columns=['A','B'])
df

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   0 -0.031160  1.939932

In [96]:
df.loc['G1']

          A         B
1 -0.925874  1.862864
2 -1.133817  0.610478
3  0.386030  2.084019

In [107]:
df.xs(key='G1')
# Num will define later

            A         B
Num
1   -0.925874  1.862864
2   -1.133817  0.610478
3    0.386030  2.084019

In [113]:
df.xs(key='G1',level='Groups')

            A         B
Num
1   -0.925874  1.862864
2   -1.133817  0.610478
3    0.386030  2.084019

In [114]:
df.xs(key=1, level='Num')

               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336

In [98]:
type(df.loc['G1'])

pandas.core.frame.DataFrame

In [97]:
df.loc['G1'].loc[1]

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [99]:
type(df.loc['G1'].loc[1])

pandas.core.series.Series

In [100]:
df.index

MultiIndex(levels=[['G1', 'G2'], [0, 1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [1, 2, 3, 1, 2, 0]])

In [101]:
df.index.names

FrozenList([None, None])

In [102]:
df.index.names = ['Groups','Num']

In [103]:
df.index.names

FrozenList(['Groups', 'Num'])

In [104]:
df

                   A         B
Groups Num
G1     1   -0.925874  1.862864
       2   -1.133817  0.610478
       3    0.386030  2.084019
G2     1   -0.376519  0.230336
       2    0.681209  1.035125
       0   -0.031160  1.939932

In [105]:
df.loc['G1'].loc[2]['B']

0.6104779075384634

# Join

In [119]:
df1 = pd.DataFrame(data={
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']
                    },

                    index=[0, 1, 2, 3]
)

In [121]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
 'B': ['B4', 'B5', 'B6', 'B7'],
 'C': ['C4', 'C5', 'C6', 'C7'],
 'D': ['D4', 'D5', 'D6', 'D7']},
 index=[4, 5, 6, 7])

In [124]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
 'B': ['B8', 'B9', 'B10', 'B11'],
 'C': ['C8', 'C9', 'C10', 'C11'],
 'D': ['D8', 'D9', 'D10', 'D11']},
 index=[8, 9, 10, 11])

In [120]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [122]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [125]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## چسباندن جداول زیر هم

In [126]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## چسباندن جداول کنار هم

In [127]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Example2 DataFrames

In [130]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']})

In [131]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [132]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# inner join

In [133]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [134]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                     'key2': ['K0', 'K0', 'K0', 'K0'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']})

In [135]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [136]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

# Inner Join

In [142]:
pd.merge(left=left, right=right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Left Join

In [143]:
pd.merge(left=left, right=right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Right Join

In [144]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

# Outer Join

In [146]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

## اینم یه مدل دیگه

In [147]:
left = pd.DataFrame(
                    {'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
    
                     index=['K0', 'K1', 'K2']
)

right = pd.DataFrame({
                    'C': ['C0', 'C2', 'C3'],
                     'D': ['D0', 'D2', 'D3']},
                     
                        index=['K0', 'K2', 'K3']
)

In [148]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [149]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# درست کردن داده های مشکل دار

In [150]:
np.nan

nan

In [153]:
d = {
    'A':[1,2,np.nan],
    'B':[5,np.nan,np.nan],
    'C':[1,2,3]
}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## فقط ردیف ھای سالم را می آورد

In [154]:
df.dropna()

     A    B  C
0  1.0  5.0  1

## فقط ستون ھای سالم را می آورد

In [155]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

## اونایی که حداقل یکیشون درسته!

In [161]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [160]:
df.dropna(thresh=None)

     A    B  C
0  1.0  5.0  1

In [156]:
df.dropna(thresh=0)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [158]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [162]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [163]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [164]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [A, B, C]
Index: []

# پرکردن

In [165]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [166]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## گروه بندی کردن

In [168]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
         'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
         'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [169]:
df.groupby('Company')

## ضمن گروه بندی کردن ، میانگین ھم می گیرد

In [170]:
by_comp = df.groupby("Company")
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

# آمار توصیفی بعد از گروهبندی

In [171]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# برعکس سازی

In [172]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [173]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [174]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [175]:
by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [176]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [177]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [178]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [179]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

# Author: Abolfazl Vakily

# Thank you